Revit 2024 API
ExternalDefinition.GetGroupTypeId Method
 Returns the identifier of the parameter definition's parameter group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override ForgeTypeId GetGroupTypeId()
Visual Basic
Public Overrides Function GetGroupTypeId As ForgeTypeId
Visual C++
public:
virtual ForgeTypeId^ GetGroupTypeId() override
See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace